{"post_0": "Never forget what the fed took from us!", "post_0_comment_1": "A McDonalds hash brown now costs $3.19 in my area.", "post_0_comment_2": "There was a glorious time in the late 2000s where we had competing dollar menus and chipotle burritos were the size of a sedan for $7.", "post_1": "Is This Genius or What?", "post_1_comment_1": "FUCK DIDNT SOMEONE DUMBASS PROPOSE THIS HERE??", "post_1_comment_2": "That is correct. I believe that Elon Musk submitted an unsolicited bid to acquire US Steel in order to obtain the X stock symbol.", "post_2": "It’s really happening, Battle of the Billionaires", "post_2_comment_1": "Who posted this? 😂", "post_2_comment_2": "Elon is doing elon shit again, hyping shit up. Knowing damn well, he's not getting into a cage with Zuck.", "post_3": "Robert Downey jr on Wall Street pits circa the 90s", "post_3_comment_1": "Bet he found some good coke though", "post_3_comment_2": "How the fuck did that actually work. Like how did anyone actually make buys when everyone is screaming and crowded around. why is that one guy on two phones and screaming at everyone else? It seems impossible to actually get anything done there.", "post_4": "Ah crap, here we go again.", "post_4_comment_1": "Mother fucker was old when I was young and now I’m old and he’s still old", "post_4_comment_2": "Well rip everyone's jobs, AI takes over everything now", "post_5": "I found a local degenerate", "post_5_comment_1": "That “motivational” poster on the wall fucking cracks me up", "post_5_comment_2": "-4k a day = -1 mill a year", "post_6": "The Return of the Regard!!!", "post_6_comment_1": "He’s always early so we got like 2 years.", "post_6_comment_2": "Christian Bale was so dedicated to his role he actually removed his eye.", "post_7": "My YOLO story continues", "post_7_comment_1": "The smart thing would be to cash out everything, uninstall RH, put your gains into an index or high dividend fund and live comfortably. So...see you on Monday.", "post_7_comment_2": "900k loss last year?", "post_8": "Name a classier way to lose money?", "post_8_comment_1": "Pinky up.", "post_8_comment_2": "Huge if true", "post_9": "US inflation means families are spending $709 more per month than two years ago", "post_9_comment_1": "Thats why I beat inflation by not having $709 more to spend each month.", "post_9_comment_2": "I got a 3% raise this year and after taxes I take home about $19 more dollars a week. Ain't cutting it.", "post_10": "Everyone Wants to Work at UPS After Union Scores $170,000 Driver Pay", "post_10_comment_1": "Ha, everyone wants to, can is a whole other issue, last job we were close with our driver, team lead, aka the guy making this kinda scratch:", "post_10_comment_2": "I'll tell you what. You show me a pay stub for 170,000 dollars on it, I quit my job right now and I work for you", "post_11": "What the fuck", "post_11_comment_1": "They’re taking the profits to Isengard!", "post_11_comment_2": "I don’t get it but I giggled anyway", "post_12": "NVDA forming a classic onix pattern. I'm going in", "post_12_comment_1": "This is the type of analysis I want to see.", "post_12_comment_2": "Make sure to borrow money, max out credit cards, and then all in OTM calls before earnings. That's a surefire way to success", "post_13": "Hacked the market with this one simple trick", "post_13_comment_1": "The Australian strategy, certified hood classic", "post_13_comment_2": "So red is good?", "post_14": "Guys, rule number 1 of trading options. Don't yolo your life savings.", "post_14_comment_1": "On the bright side the guy doesn't have to leave the country to dodge the IRS on his 50k tax bill anymore. edit: spelling", "post_14_comment_2": "I love how he's super mad at the sub, and is cursing everyone on here...", "post_15": "Option trading bros", "post_15_comment_1": "$1000 lottery tickets each month just hits that spot ya know", "post_15_comment_2": "25 years? But I want one million today!", "post_16": "I will owe $50k to the IRS. Should I flee the country?", "post_16_comment_1": "I always thought it was incumbent upon the investor to factor the capital gains tax into their capital gains. If I made a good YOLO and made an ass load of money, I’d sit on at least 20% of that for tax purposes.", "post_16_comment_2": "I hear if you run across the DMZ you free and clear OP.", "post_17": "Arizona 99c can trading below the face value. Inflation = over.", "post_17_comment_1": "You saying if i invest 88k into teas i can go sell em for 100k? But then the taxes 🥹", "post_17_comment_2": "Holy shit I’ll take a million.", "post_18": "MY (f19) BF (22M) JERKED OFF TO THE STOCK MARKET??", "post_18_comment_1": "You can dress as his favorit stock", "post_18_comment_2": "What did I half just read", "post_19": "Mortgage rates at its highest in 23 years, don't worry you all it's priced in", "post_19_comment_1": "23 years ago this 450k house used to cost 80k", "post_19_comment_2": "People complaining about rent too expensive,", "post_20": "Apple has ALWAYS been the winner", "post_20_comment_2": "Looks like you lost 12k. That sucks", "post_21": "WSB Twitter account suspended 5 minutes after posting about Elon Musk acquiring US Steel ($X)", "post_21_comment_1": "When the media inevitably shows up to this thread, I just want them to know that we should normalize pooping while running and it really doesnt receive enough coverage.", "post_21_comment_2": "Holy fuck imagine dedicating your life to understanding the steel industry and taking a large position in US Steel only to have a regarded billionaire buy the company for the ticker symbol.", "post_22": "Spotify suffers $6 billion bloodbath amid price hikes", "post_22_comment_1": "I’ve said it once and I’ll say it again… if I could download a car, you’re goddamn right I would!", "post_22_comment_2": "As long as they don't fuck with my Spotify/Hulu combo", "post_23": "This is not Apple, Nvidia, or Tesla its the US debt", "post_23_comment_1": "It’s $35 bucks. Not concerned.", "post_23_comment_2": "GDP vs National Debt", "post_24": "Please meet the inventor of the “Hinge Fund”", "post_24_comment_1": "This is both the smartest and dumbest thing I’ve ever heard in my fucking life.", "post_24_comment_2": "Damn, so I’m not going on a date this weekend", "post_25": "😂", "post_25_comment_1": "Imagine reading up on buffet, going to a fancy business school, landing a dream job at a hedge fund, and then being assigned meme stock subreddit monitoring duty.", "post_25_comment_2": "Get wrecked nerd!", "post_26": "Size doesn’t matter right guys??", "post_26_comment_1": "You made profits?", "post_26_comment_2": "Now do one about your bags", "post_27": "Wtf just happened", "post_27_comment_1": "making 200$ profit every day of the year, consistency is important!", "post_27_comment_2": "I bought calls. That happend"}