{"post_0": "Daily Discussion Thread for August 02, 2023", "post_0_comment_0": "Imagine not selling after a historic first 7 months🫵😂", "post_0_comment_1": "", "post_0_comment_2": "", "post_0_comment_3": "What time is V? Why’s market dumping?", "post_0_comment_4": "If you’re not buying target right now you’re an idiot", "post_1": "Most Anticipated Earnings Releases for the week beginning July 31st, 2023", "post_1_comment_0": "I need some big dick energy as a SOFI bag holder.", "post_1_comment_1": "Highly regarded and based.", "post_1_comment_2": "Take CVNA off the list, they reported already.", "post_1_comment_3": "Paypal users up, revenue beat or head down to 60", "post_1_comment_4": "Amazon don’t fuck with me", "post_2": "I actually did it (lost 10k. I make 21k/yr)", "post_2_comment_0": "TL;DR: I made some bad trades and now I'm in a lot of debt.", "post_2_comment_1": "Everyone thinks the market can make them rich. We all see posts where people make $100k’s a day. Remember, 10x are doing the exact opposite and losing their ass.", "post_2_comment_2": "confirmed regard. the only thing OP has going for them as an advantage over some of the idiots losing their shirts on this sub is that they could probably submit transaction history as evidence to claim disability checks.", "post_2_comment_3": "I cant tell if the posts here are satirical or not. Stepping away from the satire for a moment, i would never do the things 90% of people here post about. It boggles the mind that a person could take out an unsecured personal loan with APR’s in the 20’s and 30’s. Is any of this real or are there actually people who will yolo their financial future on meme stonks? Well keep it up boys, im entertained.", "post_2_comment_4": "Take out your money and use it to repay the loan for now. With that you're essentially buying yourself time to scale up your income through work. Make double shifts, night shifts, whatever is needed to repay the loan. Once you're done, look at yourself in the mirror, be realistic and never touch options again.", "post_3": "Up $55K in one trade, pay for college or back into options?", "post_3_comment_0": "TL;DR: I made a lot of money trading options on biotech stocks and I'm not sure what to do with it all.", "post_3_comment_1": "AND he has 3 chances to repeat what he did. If he fails in all 3, he still has $52,000 down on school, all good with the IRS, and learned that he was just lucky.", "post_3_comment_2": "Same happened to me at your age (turned $10K to $65K in 2 months). I should have cashed out but I went on to lose 90% of my funds in a few months.", "post_3_comment_3": "Paying taxes and his loans will make him several step ahead of lots of people, he can start with $5k again but in better position", "post_3_comment_4": "Housing in Berkeley is $$$", "post_4": "Puts and Calls (actually) explained", "post_4_comment_0": "TL;DR: If you think a stock is going to go up, you buy a call. If you think it's going to go down, you buy a put. You're basically betting on the price of the stock.", "post_4_comment_1": "The problem with your example is that you made a profit…you know that doesn’t happen here.", "post_4_comment_2": "Now I swing trade weeklies on the most volatile stocks.", "post_4_comment_3": "I feel like pointing out that option contracts are for 100 shares is important here.", "post_4_comment_4": "stock?", "post_5": "All in!", "post_5_comment_1": "Smart money volume .", "post_5_comment_3": "So whos teddy kgb in this scenerio lol", "post_5_comment_4": "😁😁", "post_6": "I’d rather have them expire worthless", "post_6_comment_1": "Lmfao your wrinkly head ain’t gunna get paid shit to suck cock - embrace poverty", "post_6_comment_2": "", "post_7": "I am that brother", "post_7_comment_0": "", "post_7_comment_1": "IT IS INVESTING IT IS INVESTING IT IS INVESTING IT IS INVESTING I AM NOT ADDICTED TO LOSING MONEY I AM NOT ADDICTED TO LOSING MONEY", "post_7_comment_2": "But the truth is someone like Andy or Jean Ralphio from the show would make a stupid killing in the market.", "post_7_comment_3": "LMAO. That feel when your “investments” have theta decay of like -70% per day and expire worthless 3 days out. Unrefrigerated cheese is a safer investment than options", "post_7_comment_4": "I am mentally ill as well - my track record on options during the past 12 months is something like 5 wins, 82 losses and 10 ties.", "post_8": "No longer AAA 😳 Fitch downgrades US debt rating. Flight to safe assets.", "post_8_comment_1": "What I took from it, they're upset the government keeps fighting over increasing the ceiling and they're fed up with it.", "post_8_comment_2": "once thought to be a short-lived phenomenon, it appears the wild trading in meme stocks is here to stay", "post_8_comment_3": "But, why male models?", "post_8_comment_4": "Who cares what Abercrombie thinks", "post_9": "What have I done?", "post_9_comment_1": "...Instead I'm living off a steady supply of Government Cheese, and 10 piece Wendy's nuggets.", "post_9_comment_2": "So pltr and dish are bad moves", "post_9_comment_3": "", "post_9_comment_4": "That face knows “if wsb is on to it… it is too late.”", "post_10": "New Bull Market", "post_10_comment_1": "Its a bot. Its always a bot. At this point I'm convinced 70% or more of this place is bots. Hell at this point I'm not even convinced that I am not a bot myself....", "post_10_comment_2": "Appreciated it. Know it had to suck.", "post_10_comment_3": "At least your local Wendy’s didn’t get burned down during the summer of love", "post_10_comment_4": "You're right, that is unfortunate. But don't worry, there are plenty of other opportunities out there for you. And remember, even though everyone may not be as wealthy as me, that doesn't mean they're all poor. There are many people who have a lot of money and live very comfortable lives. So don't give up hope!", "post_11": "Last time Fitch downgraded US credit ratings was Aug 5th 2011, the same exact week as today.", "post_11_comment_1": "Depends on what Cramer says", "post_11_comment_2": "No one knows who Fitch is. We are USA", "post_11_comment_3": "That’s exactly what Obama said in public in 2011 in slightly different words", "post_11_comment_4": "Fitches get stitches", "post_12": "It’s honestly an indication for a multi-year bull market", "post_12_comment_1": "I have bought and sold NVDA so many times this year it is unreal.", "post_12_comment_2": "Luckily I'm only renting my debt.", "post_12_comment_3": "It's an American rating system for American government, how regarded could they be , none they want to be the victim, raise more taxes for the poors, lower quality of living, then bounce back the rating and conclude it was all because of a political party we got the score up.", "post_12_comment_4": "Larry 'Cocaine Cowboy' Kudlow", "post_13": "It ain’t much but it’s honest work $AMD edition", "post_13_comment_1": "", "post_13_comment_2": "He's a millionaire. He could afford that shit prior to his 12% gain.", "post_13_comment_3": "I knew that’s why I keep losing… If I had $1.5m instead of $1500 I’d turn everything around.", "post_13_comment_4": ""}