{"post_0": "Well...", "post_0_comment_1": "next step is 0% down with a valid college ID", "post_0_comment_2": "Paying 7% interest on 80% of the purchase price", "post_1": "Never forget what the fed took from us!", "post_1_comment_1": "A McDonalds hash brown now costs $3.19 in my area.", "post_1_comment_2": "There was a glorious time in the late 2000s where we had competing dollar menus and chipotle burritos were the size of a sedan for $7.", "post_2": "Sold Everything!!! Building a House….", "post_2_comment_1": "Dude good shit glad to see someone make it to the other side", "post_2_comment_2": "Now delete the app and unsubscribe from us regards", "post_3": "Is This Genius or What?", "post_3_comment_1": "FUCK DIDNT SOMEONE DUMBASS PROPOSE THIS HERE??", "post_3_comment_2": "That is correct. I believe that Elon Musk submitted an unsolicited bid to acquire US Steel in order to obtain the X stock symbol.", "post_4": "It’s really happening, Battle of the Billionaires", "post_4_comment_1": "Who posted this? 😂", "post_4_comment_2": "Elon is doing elon shit again, hyping shit up. Knowing damn well, he's not getting into a cage with Zuck.", "post_5": "If you're buying TSLA @ $250, you better be really, really, REALLY sure a non-negligible number of human beings want to be seen driving this", "post_5_comment_1": "Lara Croft’s boob", "post_5_comment_2": "It looks like it's still rendering", "post_6": "We all know it’s coming…", "post_6_comment_2": "The truck hits a bump... guess who won't be falling off?", "post_7": "Ironman explaining 90s Wallstreet", "post_7_comment_1": "Well he's not wrong.", "post_7_comment_2": "That tirade at the end sounds like he visited WSB.", "post_8": "Never had more than 30k at one time in my life. Made that within 7 hours today...", "post_8_comment_1": "OP if you legitimately turned 300 dollars into 50k in 12 days. Do yourself a favor and acknowledge that you've gotten extremely lucky. Take like 45k and play with the rest. if you can do it again, do the same thing. there's your 100k right there and you don't have to gamble your entire life for it. Or just fucking throw 50k into calls or whatever. post your results", "post_8_comment_2": "Take it out and delete Robinhood", "post_9": "I just spent two months in China. Don't believe the CCP reporting 21% youth unemployment, it is definitely way, way higher."}