{"post_0": "Daily Discussion Thread for August 02, 2023", "post_0_comment_0": "Bers suck at dumping", "post_0_comment_1": "I don't think any of you understand the macro and what's coming. They should've let this do it's thing months ago. Buybacks, bs AI pumps, and blatant manipulation to keep us from plummeting into the deprhs of hell.", "post_0_comment_2": "In hindsight I should've full ported into TLRY", "post_0_comment_3": "Embrace the dump don’t fight it bulls 🐻", "post_0_comment_4": "Made 460 on open", "post_1": "Most Anticipated Earnings Releases for the week beginning July 31st, 2023", "post_1_comment_0": "I need some big dick energy as a SOFI bag holder.", "post_1_comment_1": "Highly regarded and based.", "post_1_comment_2": "Take CVNA off the list, they reported already.", "post_1_comment_3": "Paypal users up, revenue beat or head down to 60", "post_1_comment_4": "Amazon don’t fuck with me", "post_2": "I actually did it (lost 10k. I make 21k/yr)", "post_2_comment_0": "TL;DR: I made some bad trades and now I'm in a lot of debt.", "post_2_comment_1": "Everyone thinks the market can make them rich. We all see posts where people make $100k’s a day. Remember, 10x are doing the exact opposite and losing their ass.", "post_2_comment_2": "confirmed regard. the only thing OP has going for them as an advantage over some of the idiots losing their shirts on this sub is that they could probably submit transaction history as evidence to claim disability checks.", "post_2_comment_3": "I cant tell if the posts here are satirical or not. Stepping away from the satire for a moment, i would never do the things 90% of people here post about. It boggles the mind that a person could take out an unsecured personal loan with APR’s in the 20’s and 30’s. Is any of this real or are there actually people who will yolo their financial future on meme stonks? Well keep it up boys, im entertained.", "post_2_comment_4": "Take out your money and use it to repay the loan for now. With that you're essentially buying yourself time to scale up your income through work. Make double shifts, night shifts, whatever is needed to repay the loan. Once you're done, look at yourself in the mirror, be realistic and never touch options again.", "post_3": "Up $55K in one trade, pay for college or back into options?", "post_3_comment_0": "TL;DR: I made a lot of money trading options on biotech stocks and I'm not sure what to do with it all.", "post_3_comment_1": "AND he has 3 chances to repeat what he did. If he fails in all 3, he still has $52,000 down on school, all good with the IRS, and learned that he was just lucky.", "post_3_comment_2": "Same happened to me at your age (turned $10K to $65K in 2 months). I should have cashed out but I went on to lose 90% of my funds in a few months.", "post_3_comment_3": "Paying taxes and his loans will make him several step ahead of lots of people, he can start with $5k again but in better position", "post_3_comment_4": "Housing in Berkeley is $$$", "post_4": "Puts and Calls (actually) explained", "post_4_comment_0": "TL;DR: If you think a stock is going to go up, you buy a call. If you think it's going to go down, you buy a put. You're basically betting on the price of the stock.", "post_4_comment_1": "The problem with your example is that you made a profit…you know that doesn’t happen here.", "post_4_comment_2": "Now I swing trade weeklies on the most volatile stocks.", "post_4_comment_3": "I feel like pointing out that option contracts are for 100 shares is important here.", "post_4_comment_4": "stock?", "post_5": "All in!"}