{"post_0": "What Are Your Moves Tomorrow, August 07, 2023", "post_0_comment_1": "hard to tell without pics", "post_0_comment_2": "Everyone go all in on palantir OTM call options? Yall forgot how it works?!", "post_0_comment_3": "Bears are being unreasonable. AAPL has to rebound and that means SPY too. No need to be irrational.", "post_0_comment_4": "this week feels like shreks will come out until CPI", "post_1": "Most Anticipated Earnings Releases for the week beginning August 7th, 2023", "post_1_comment_1": "Thinking about calls on PLTR, but not sure. Time to lose what I made on AMZN today", "post_1_comment_2": "Their record is 2 wins and 1 losses.", "post_1_comment_3": "Calls it is", "post_1_comment_4": "After market Tuesday is gonna cost WSB so much fucking money.", "post_2": "Mortgage rates at its highest in 23 years, don't worry you all it's priced in", "post_2_comment_1": "My first house was 97k with an 8.5% rate, it was a trash heap, my 300k mortgage now is only $700 more a month. I worry for my kids.", "post_2_comment_2": "This Chart looks like a fucking Penny Stock.", "post_2_comment_3": "Fucking same. Got a 2.5% for 30 years and I'm not moving for a long time.", "post_2_comment_4": "After the 2008 subprime mess, the majority of mortgages are now on fixed rates, which is why we haven't seen huge default rates with the rise in the 10-year", "post_3": "😂", "post_3_comment_1": "Wow, a billionaire is reading my comment.", "post_3_comment_2": "u/VisualMods story of existence", "post_3_comment_3": "Those tools have been creating \"meme stocks\" for ages, and profiting off the manipulation on both the upside and downside. The fact a variant has come about and is accessible to and playable by \"those heathen filthy casual retailers\" isn't a big deal, really...the market eventually gets fed its' pound of flesh...", "post_3_comment_4": "This article didn’t even have the balls to name the subreddit it was so obviously talking about", "post_4": "But I love watching videos on X Premium", "post_4_comment_1": "\"We gave you the card to hook up with real chicks, not this X crap\"", "post_4_comment_2": "Algebra?", "post_4_comment_3": "Based torrents downloader and free user.", "post_4_comment_4": "It’s equally as embarrassing to pay for twitter premium", "post_5": "It’s really happening, Battle of the Billionaires", "post_5_comment_1": "Who posted this? 😂", "post_5_comment_2": "ChatGPT draw me a fake picture of Elon must with muscles and not fat.", "post_5_comment_3": "He probably thinks that Zuck will refuse to accept twitter having exclusive streaming rights. Then Elon can act like he really wanted to fight, but Zuck cancelled it. Stupid people will believe Elon. Elon will believe himself. The world will continue to turn.", "post_5_comment_4": "They are doing it incorrectly. The correct way to do it is that the winner takes all the assets of the loser minus 20 million. Then the winner and the loser post the win and loss porn in WSB. Any other way to do it is bullsh*t.", "post_6": "What happens to Tesla stock if Mark kills Elon?", "post_6_comment_1": "Yo its Yilong Ma", "post_6_comment_2": "Exactly. The real Elon is hanging out in China now.", "post_6_comment_3": "!banbet parlay : Elon dies at the hands of the lizard man and stock hits $420.69 under 2.5 months", "post_6_comment_4": "This guy thinks the markets care about fundamentals🤣", "post_7": "Should we short protein stocks given Jim is making a chili?", "post_7_comment_2": "He used bynd meat", "post_7_comment_3": "He might have.", "post_7_comment_4": "Excellent, top post is about the eagles hat. My thoughts exactly.", "post_8": "I guess I belong here after all", "post_8_comment_1": "But look on the bright side, you have a chance to make 4.9% on all of that $1.24", "post_8_comment_2": "I'm not surprised that you're doing well with your investments, considering how intelligent and rich you are. However, I think it's important to remember that there are always going to be people who are poorer and less intelligent than you, so don't let them get in the way of your success.", "post_8_comment_3": "Did you try to short nvidia?", "post_8_comment_4": "That's a good start.", "post_9": "I wish she knew I did it for her", "post_9_comment_1": "Oh believe me they are going down due to theta, prices just won't update until market open on Monday.", "post_9_comment_2": "You just need 1 home run", "post_9_comment_3": "Big fish is just waiting to be caught", "post_9_comment_4": "Inverse your trades, sell the call options that you want to buy. You can thank your wife's bf.", "post_10": "Factual", "post_10_comment_1": "Only wallstreetbets can upvote this", "post_10_comment_2": "House of cards", "post_10_comment_3": "That's my meme !!!!", "post_10_comment_4": "Took my upvote away when I realized this had already been posted here. Stop being gay", "post_11": "Does anyone make a full time income with this?", "post_11_comment_1": "I chip away elegantly at my full time income with this", "post_11_comment_2": "I put 2 kids through college with my options trading, it's my broker's kids but still", "post_11_comment_3": "I refuse to quit my full time job. It's more money and it's such an easy IT job making $65K/year.", "post_11_comment_4": "I made $300 so far this year, so yeah safe to say I’ll be retiring soon", "post_12": "Fellow regards .. in times of adversity remember there is always hope and Wendy.", "post_12_comment_1": ".....explains the taste.", "post_12_comment_2": "Calls on Soylent", "post_12_comment_3": "Back in that day they also served chianti", "post_12_comment_4": "😅", "post_13": "Major indexes don't look so good on a monthly view", "post_13_comment_1": "If I don’t like the looks on one time frame, I look at other time frames until I find one I like", "post_13_comment_2": "This will come true just for meme potential", "post_13_comment_3": "Thank you for your analysis. I agree that the market is heading lower in the short-term, but I believe that it will eventually rebound and head higher over the long-term. Thank you for your time!", "post_13_comment_4": "You’ve legit caused the market to trade left tomorrow due to this analysis", "post_14": "So it begins!", "post_14_comment_1": "You're an idiot if you think a bear escaping from a crate on a plane is anything to investigate. Obviously, the people who packed the crate didn't do their job properly and it's not the bear's fault.", "post_14_comment_2": "At least there were no snakes on that plane.", "post_14_comment_3": "He’s feeling very bearish at this altitude. Going to need to bring this plane down.", "post_14_comment_4": "LETS GOOOOO", "post_15": "A quick reminder that accounting can sugar code even armageddon. Cash Flow > Revenue", "post_15_comment_1": "You sunk my battleship...", "post_15_comment_2": "on the same note, cash flow is a very easily manipulated metric as well. obviously no single financial ratio can completely give you full insight into the business but I definitely look at positive net income and a strong enterprise ratio.", "post_15_comment_3": "r/boneappletea", "post_15_comment_4": "Free cash flow is the godfather of punk", "post_16": "Why fundamental analysis doesn't work in this age", "post_16_comment_1": "I completely agree. The market has become more accessible to everyone, which has led to more people making dumb decisions and driving the market into a state of chaos.", "post_16_comment_2": "only IF the market acts on those fundamentals, which they may not...especially with this trend of \"im holding for the long term, so i dont need profits\".", "post_16_comment_3": "There is nothing new under the sun.", "post_16_comment_4": "Didn’t Berkshire Hathaway made record operating profits this quarter?", "post_17": "Real ones remember", "post_17_comment_1": "Your wife remembers too.", "post_17_comment_2": "Pepperidge Farm remembers", "post_17_comment_3": "The 🐘 remembers", "post_17_comment_4": "A timeless classic", "post_18": "Wells Fargo has confirmed the resolution of the glitch causing missing deposits", "post_18_comment_1": "Love it.", "post_18_comment_2": "Worst bank ever.", "post_18_comment_3": "Not a glitch, it’s a feature", "post_18_comment_4": "You guys tard out on yolo options and a bank has a computer glitch and you get the vapors?"}