{"post_0": "Daily Discussion Thread for August 02, 2023", "post_0_comment_0": "when V", "post_0_comment_1": "spy try 450 again", "post_0_comment_2": "Friendship with V is ended, Clifford is my new best friend", "post_0_comment_3": "they think they can downgrade america land of the free???", "post_0_comment_4": "Their record is 1 wins and 7 losses.", "post_1": "Most Anticipated Earnings Releases for the week beginning July 31st, 2023", "post_1_comment_0": "I need some big dick energy as a SOFI bag holder.", "post_1_comment_1": "Highly regarded and based.", "post_1_comment_2": "Take CVNA off the list, they reported already.", "post_1_comment_3": "Paypal users up, revenue beat or head down to 60", "post_1_comment_4": "Amazon don’t fuck with me", "post_2": "I’d rather have them expire worthless", "post_2_comment_1": "You mean behind Wendy's", "post_2_comment_2": "Long live the Zombie Jewish Carpenter!", "post_2_comment_3": "No they won’t slut", "post_2_comment_4": "Sold my one put for 150 profit today. It's honest work a", "post_3": "Geopolitics is your sandbox", "post_3_comment_0": "If our game interests you, please check out our Steam page.", "post_3_comment_1": "I'd really like a game similar to that (but a professional game)", "post_3_comment_2": "Anyway thank ya for the demo, definitely looking forward to the release (and a functional save button) :>", "post_3_comment_3": "I am improving! I constructed my first station before the crash, which I was no where near doing the last time.", "post_3_comment_4": "this looks really good. did you put a Templin institute easer egg in the game?", "post_4": "WSB's reaction to the USA credit rating downgrade", "post_4_comment_1": "Red still doesn't mean good...right.", "post_4_comment_2": "Yellen is hard at work creating memes to change opinion.", "post_4_comment_3": "My options cared.", "post_4_comment_4": "Gong to rocket so fast once people figure it out", "post_5": "Comment Your YTD %", "post_5_comment_1": "Investing and Yolo’ing SPY calls are two different things my smooth brained regard. Post positions so I can do the opposite, at least one of us will get rich that way", "post_5_comment_2": "😂", "post_5_comment_3": "Why lose 4% over a year when you can lose 15% in a day.", "post_5_comment_4": "+14.64% YTD", "post_6": "I actually did it (lost 10k. I make 21k/yr)", "post_6_comment_0": "TL;DR: I made some bad trades and now I'm in a lot of debt.", "post_6_comment_1": "Everyone thinks the market can make them rich. We all see posts where people make $100k’s a day. Remember, 10x are doing the exact opposite and losing their ass.", "post_6_comment_2": "I cant tell if the posts here are satirical or not. Stepping away from the satire for a moment, i would never do the things 90% of people here post about. It boggles the mind that a person could take out an unsecured personal loan with APR’s in the 20’s and 30’s. Is any of this real or are there actually people who will yolo their financial future on meme stonks? Well keep it up boys, im entertained.", "post_6_comment_3": "He doesn’t just suck at risk tolerance. He sucks at everything. Reading the post, just like most regular WSB ‘traders’ he got a few really lucky lotto trades, felt like he knew what he was doing, and then proceeds to do what he was doing- randomly betting on stocks and buying bad options. The post, he is just trading like ‘let’s try this one, let’s try that one’. The kid shouldn’t be trading", "post_6_comment_4": "Take out your money and use it to repay the loan for now. With that you're essentially buying yourself time to scale up your income through work. Make double shifts, night shifts, whatever is needed to repay the loan. Once you're done, look at yourself in the mirror, be realistic and never touch options again.", "post_7": "What Fitch thinks of the US", "post_7_comment_1": "Western roman empire", "post_7_comment_2": "Helping to manufacture that fall. They are gay losers and nobody trusts them after 2008", "post_7_comment_3": "Why these idiots are allowed to influence anything after 2008 is beyond me. Credit rating agencies in general aren't beneficial to consumers or investors. Shills for the 1%.", "post_7_comment_4": "New York", "post_8": "Up $55K in one trade, pay for college or back into options?", "post_8_comment_0": "TL;DR: I made a lot of money trading options on biotech stocks and I'm not sure what to do with it all.", "post_8_comment_1": "AND he has 3 chances to repeat what he did. If he fails in all 3, he still has $52,000 down on school, all good with the IRS, and learned that he was just lucky.", "post_8_comment_2": "Same happened to me at your age (turned $10K to $65K in 2 months). I should have cashed out but I went on to lose 90% of my funds in a few months.", "post_8_comment_3": "Paying taxes and his loans will make him several step ahead of lots of people, he can start with $5k again but in better position", "post_8_comment_4": "Housing in Berkeley is $$$", "post_9": "Puts and Calls (actually) explained", "post_9_comment_0": "TL;DR: If you think a stock is going to go up, you buy a call. If you think it's going to go down, you buy a put. You're basically betting on the price of the stock.", "post_9_comment_1": "Here’s the true explanation", "post_9_comment_2": "Now I swing trade weeklies on the most volatile stocks.", "post_9_comment_3": "I feel like pointing out that option contracts are for 100 shares is important here.", "post_9_comment_4": "Now explain what a stock is.", "post_10": "All in!", "post_10_comment_1": "Smart money volume .", "post_10_comment_3": "So whos teddy kgb in this scenerio lol", "post_10_comment_4": "😁😁", "post_11": "Für alle, die sich nicht mit technischen Specs aufhalten wollen. Auf dem Agentur-Server bekommst du immer die optimale Performance für dein Webhosting – egal, wie sich deine Projekte entwickeln. Jetzt entdecken!", "post_12": "What have I done?", "post_12_comment_1": "you got 10-piece Wendy's nuggets, you can tell those are not two-day old nuggies he capitalize Wendy's.", "post_12_comment_2": "That face knows “if wsb is on to it… it is too late.”", "post_12_comment_3": "So pltr and dish are bad moves", "post_13": "Just sold 15 of my 20 calls. Take profit when you want not when you have to", "post_13_comment_1": "You're an idiot if you don't buy this stock. It's going to go up a lot in the next few years.", "post_13_comment_2": "I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.", "post_13_comment_3": "thanks. your wife says its your turn next! 🏳️‍🌈🥰", "post_13_comment_4": "I don't understand.", "post_14": "I am that brother", "post_14_comment_0": "That’s not gambling. That’s just throwing away money. Gambling implies that there’s at least some defined probability of winning Lmao", "post_14_comment_1": "IT IS INVESTING IT IS INVESTING IT IS INVESTING IT IS INVESTING I AM NOT ADDICTED TO LOSING MONEY I AM NOT ADDICTED TO LOSING MONEY", "post_14_comment_2": "You either make a killing or end up at Wendy's, there is no middle ground", "post_14_comment_3": "LMAO. That feel when your “investments” have theta decay of like -70% per day and expire worthless 3 days out. Unrefrigerated cheese is a safer investment than options", "post_14_comment_4": "I am mentally ill as well - my track record on options during the past 12 months is something like 5 wins, 82 losses and 10 ties.", "post_15": "No longer AAA 😳 Fitch downgrades US debt rating. Flight to safe assets.", "post_15_comment_1": "What I took from it, they're upset the government keeps fighting over increasing the ceiling and they're fed up with it.", "post_15_comment_2": "once thought to be a short-lived phenomenon, it appears the wild trading in meme stocks is here to stay", "post_15_comment_3": "But, why male models?", "post_15_comment_4": "Who cares what Abercrombie thinks", "post_16": "Guys I think I went a little crazy doubling down on AMD", "post_16_comment_1": "Bro you don't understand... Just hear me out please bro please. Stocks only go up. Trust me bro. They only go up.", "post_16_comment_2": "I am not a fan of losing money, and today's performance was certainly disappointing. However, I remain confident in my ability to generate profits for my investors over the long term. As such, I will continue to recommend buying AMD $114 and $112 calls expiring on August 4th.", "post_16_comment_3": "Lemme hold a grand big man", "post_16_comment_4": "You are an idiot"}