{"post_0": "Daily Discussion Thread for July 31, 2023", "post_0_comment_0": "If you don’t take profits as a bear they will bend you over and rape you before you can sell", "post_0_comment_1": "and its dumping again wow", "post_0_comment_2": "Being a bear is so fucking sad. I’m done with it", "post_0_comment_3": "", "post_0_comment_4": "Elon is aggressively shorting META.", "post_1": "❄️❄️❄️ Tom Hanks with the Monday Morning WSB Energy! ❄️❄️❄️", "post_1_comment_1": "“I Ignore the Greeks unless they are making me gyros” 😭", "post_1_comment_2": "LOL! Unless you’re the Incredible Hulk your gamma don’t worry me! Fucking love it.", "post_1_comment_3": "CHAD BULL HANKS vs. GAY BEAR CRAMER", "post_1_comment_4": "Sorry about the repost, the audio was fucked in the last one.", "post_2": "Name a classier way to lose money?", "post_2_comment_1": "Pinky up and cock out", "post_2_comment_2": "Huge if true", "post_2_comment_3": "It's trading asymmetrical financial derivatives.", "post_2_comment_4": "You had my except for “high end”", "post_3": "A lot of you when meta was at 100$", "post_3_comment_1": "", "post_3_comment_2": "", "post_3_comment_3": "Well yeah this is WSB. When the stock is low you don't buy and then also make sure to sell any shares you have because the company is clearly going bankrupt. And when the stock is high you buy hand over fist because the company is clearly going to revolutionize everything!", "post_3_comment_4": "That said, they WERE really undervalued at the time. At these valuations, might not be the worst long term short.", "post_4": "Some of you could reach this in a week", "post_4_comment_1": "Nah, gotta wait for my day trades to reset.", "post_4_comment_2": "Guess that's why there's so many jacked people working at Wendy's these days", "post_4_comment_3": "only able to deploy $ in like once a week", "post_4_comment_4": "Much better than one punch man's workout.", "post_5": "This is not Apple, Nvidia, or Tesla its the US debt", "post_5_comment_1": "This makes it look way less scary", "post_5_comment_2": "It’s whatever Trillions are. Probably some shithole currency worth $0.69", "post_5_comment_3": "The solution is to YOLO your money into Apple, Nvidia, and Tesla calls, then pay the short-term gains taxes. Then the Federal Government can pay down the debt, and when they're feeling spendy, they'll issue giant contracts to the same companies so you can YOLO again!", "post_5_comment_4": "Vote me in for president or congress and I'll fix it. I'll do one term because I'll be murdered after I fix it.", "post_6": "It ain't much but it's honest work...", "post_6_comment_1": "For the small fee of $2000, I can show you how to make $2000, too!", "post_6_comment_2": "You're a fucking idiot if you think SQQQ is going to rebound. TQQQ is the only way to go if you want to make any money in this market.", "post_6_comment_3": "Thanks for the motivation! 💪", "post_6_comment_4": "for how long you keeping it?", "post_7": "Weekly PLTR YOLO Update. Holding for 50-100. Palantir is the most important company in the world right now!", "post_7_comment_1": "Harvard scientists have figured out that the best time to take profits is shortly after taking a screenshot", "post_7_comment_2": "If it goes 🚀then I’ll just buy the college they want to attend.", "post_7_comment_3": "I always listen to a Motley Fool article. It has really helped make a difference in my trading", "post_7_comment_4": "Seems meme season is back you know what to do boys and girls", "post_8": "What the fuck", "post_8_comment_1": "To Isengard! To Isengard!", "post_8_comment_2": "You want eli5?", "post_8_comment_3": "I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.", "post_8_comment_4": "Gotta say it caught me off guard.", "post_9": "The \"stock market\" is boring...", "post_9_comment_1": "Love you @visualmod", "post_9_comment_2": "I covered them too. Bought $1 lotto's on all the teams with +10000", "post_9_comment_3": "You made 100% profit? I’d cash out", "post_9_comment_4": "i'm going with CANADA", "post_10": "Where mortgage crisis.", "post_10_comment_1": "Still waiting…😭", "post_10_comment_2": "Poor millennials came of age amidst a once in a lifetime crisis and led to believe by the media that that crisis will repeat itself. The real lesson is each crisis screws over society in a new and different way. Also, post-2008 don't fight the Fed (or central banks in general).", "post_10_comment_3": "😂", "post_10_comment_4": "Till the renewal of flexible mortgages", "post_11": "18 year old meets 0DTE SPY Puts", "post_11_comment_1": "100% chance this goes to zero. Cash out and learn about the market. 0dte has nothing to do with strategy it’s dumb luck", "post_11_comment_2": "Yeah, the loss porn on this one should be fun.", "post_11_comment_3": "Cash out everything and keep $4300 and do it again. You did not \"find a pattern\" you got lucky 3 times.", "post_11_comment_4": "Can’t wait for the loss porn on Tuesday", "post_12": "One of us...", "post_12_comment_1": "Legend says it was DishGuy.", "post_12_comment_2": "The R8 does have the Lambo v10 in it though, so he was almost there. Probably missed 1 YOLO.", "post_12_comment_3": "damn man, dream car right here", "post_13": "Cramer just gave X his blessings", "post_13_comment_1": "Im going to go on X and watch some xvideos", "post_13_comment_2": "Now he is commenting on non-publically traded companies?", "post_13_comment_3": "I have a feeling Jim Cramer thinks of porn whenever any subject is brought up.", "post_13_comment_4": "Jim Cramer is an idiot. He knows nothing about investing or the stock market.", "post_14": "Party bros give some stock market wisdom", "post_14_comment_1": "Send it to me, and I give it to them. Trust me bro.", "post_14_comment_2": "The top is in", "post_14_comment_3": "i continue to email joe biden to request a drone strike to his location", "post_14_comment_4": "Jabronis, cool word.", "post_15": "UPDATE: Roku to the moon 💎", "post_15_comment_1": "Congrats and fuck you 😘", "post_15_comment_2": "These are still OTM and expire Friday. Please sell these and take the win.", "post_15_comment_3": "", "post_15_comment_4": "Wow. Hope you lock in some profits", "post_16": "Time to build a crap stock portfolio?", "post_16_comment_1": "Oh man pltr this morning..... 🍆", "post_16_comment_2": "lehman brothers will come back stronger, this is our year", "post_16_comment_3": "r/investing is this way", "post_16_comment_4": "Nowhere to go but . . . up . . . ??", "post_17": "A better metric for tracking debt. Interest on the national debt to GDP.", "post_17_comment_1": "youre a based king", "post_17_comment_2": "Then interest payments collapsed during Clintons presidency . Republican borrow and spend while Dems tax and spend", "post_17_comment_3": "You can't go from 5% budget to 25% budget and growing without massive issues.", "post_17_comment_4": "But, servicing the gargantuan debt is still a MASSIVE issue…that MSM just seems to ignore.", "post_18": "July 31 - Long term CVNA holdings", "post_18_comment_1": "^", "post_18_comment_2": "Don't be stupid and take profits.", "post_18_comment_3": "I’m about to unload my cvna I have a sneaking feeling.", "post_18_comment_4": "I am not sure what you are asking me."}