{"post_0": "MY (f19) BF (22M) JERKED OFF TO THE STOCK MARKET??", "post_0_comment_1": "You can dress as his favorit stock", "post_0_comment_2": "What did I half just read", "post_1": "AI will never replace us", "post_1_comment_1": "our normal hands have no chance.", "post_1_comment_2": "Midjourney 0.2? lol old meme", "post_2": "RIP in Peace PLTR Call Holders", "post_2_comment_1": "Numbers are wrong but the meme is still funny.Pltr has 2B in revenue while nvidia is doing 30B.", "post_2_comment_2": "Meme might be funny if it was remotely accurate", "post_3": "Made a profit of $1 after being negative for ~2 years – Where’s my Noble prize?", "post_3_comment_1": "Sounds like you got your WSB diploma. Well deserved, I might ad. $1 profit in a year is WAY above the average here.", "post_3_comment_2": "Noble prize 😁", "post_4": "$4.6K in 10 seconds / $10K+ gain day", "post_4_comment_1": "You're a fucking idiot.", "post_4_comment_2": "Good luck. Now post it back tomorrow", "post_5": "I know pattern recognition isn't really a thing here at WSB, but why are you still with Robinhood?", "post_5_comment_1": "That’s the most common chart pattern that WSB members have perfected.", "post_5_comment_2": "Fill system is absolute garbage. What keeps me hooked is the user interface.", "post_6": "Zoom, the company that saw a 420% increase in its share price during COVID, tells its workers to return to the office", "post_6_comment_1": "Every CEO with a return to office mandate seems to have a business in which they want to see voluntary reduction in force without paying severance.", "post_6_comment_2": "420% share price growth, so they have 69 days to comply.", "post_7": "PayPal just opened a door", "post_7_comment_1": "My long PayPal position is down 75%. You better not be lying about some good news", "post_7_comment_2": "Lemme explain something to you. All those regards didn't buy crypto to pay for things with it but to get rich. If they wanted to use their dogecoin for groceries, they can exchange it for real money anytime.", "post_8": "Paypal Bearish, found Big Penis Formation", "post_8_comment_1": "Big dick mountain formation is actually ultra bullish!!🚀🚀🚀", "post_8_comment_2": "No no, that's an uncut cock and balls formation, with a varying pube length pattern across the testicular range. That's extremely bullish for the 69 day moving average.", "post_9": "Just discovered 0day SPY options today, ama!", "post_9_comment_1": "Not the best performance. The real heavy weights are able to get to at least -90% on the first day.", "post_9_comment_2": "You may want to discover stop-losses next.", "post_10": "💎 Palantir Earnings Soar: $1 Billion Buyback Approved – Time for a Moonshot! 🚀💎✋", "post_10_comment_1": "Up 1% after hours, moon shot", "post_10_comment_2": "I’m still holding PLTR at $22 from back in 2020 when I first discovered this subreddit and everyone said it would make me rich. Apparently selling in 2021 was the key there.", "post_11": "Just remember: the market is supposed to go up.", "post_11_comment_1": "Username checks out lol", "post_11_comment_2": "Thank you for your input, recklessSPY. I completely agree that the market is rigged to go up in the long run. However, there are definitely periods of time where it corrects itself or experiences black swan events. I think that smart investors like us can still profit during these times by finding beaten down sectors or early trends. Thanks again for your thoughts!", "post_12": "The New Meta Build", "post_12_comment_1": "ARE YOU NOT ENTERTAINED?!", "post_12_comment_2": "I think that the U.S. government testifying under oath that aliens exist, suing presidents, and two autistic nerds who own the largest social networks on Earth doing karate are all distractions from more important issues. The Roman Colosseum was built to distract citizens from the stress of geopolitical inter-warring, economic turmoil, and famine, and I believe that these current events are being used to distraction people from similar problems today.", "post_13": "$37k PYPL YOLO", "post_13_comment_1": "If you can’t trust a guy named Pussybreath then i don’t want to live in this world. I’m riding shares with you brother! Let’s print!", "post_13_comment_2": "Pussybreath is yoloing pypl? Fuckit im in. I for one respect a man with pussy breath. It shows they care about others", "post_14": "Its never the right time", "post_14_comment_1": "Hmmm, somehow I don’t think this clock is right even twice a day…", "post_14_comment_2": "Time is a flat circle......of infinite losses", "post_15": "PLTR stock buyback…", "post_15_comment_1": "I’m LT boolish…", "post_15_comment_2": "They have to buy it back so they can give more out as SBC", "post_16": "Both tax receipts and US revolving consumer credit are down.", "post_16_comment_1": "Its so cool how every week theres a new graph explaining why the world is ending", "post_16_comment_2": "I am truly regarded to be long an EV maker in rising interest rate market.", "post_17": "I never f**king learn but I’m so bullish on them.", "post_17_comment_1": "This is Wall Street Bets, no one actually expects you to make any money, so go after what makes you happy... you only live once my friend.", "post_17_comment_2": "Fingers crossed on my puts", "post_18": "What Are Your Moves Tomorrow, August 08, 2023", "post_18_comment_1": "What happened bros? Just woke up", "post_19": "I quit. For real this time... (just as soon as this PLUG thing runs its course...)", "post_19_comment_1": "Total Gain $-20,249.72", "post_19_comment_2": "Just for my interest….Are you keeping these positions? Just wanna know if I should inverse all of them to be a millionaire.", "post_20": "$AMC actually had a cash positive quarter / net income instead of another loss - so calls or puts now?", "post_20_comment_1": "Why did they release early tf", "post_20_comment_2": "It is difficult to say for certain what will happen in the stock market, as there are many factors that can affect prices. However, based on the earnings release from AMC, it appears that the company is doing well and its stock price could continue to rise.", "post_21": "I belong here", "post_21_comment_1": "Strong Batman pattern early on indicates high likelihood of a further drop. Strong short indicator. Well done.", "post_21_comment_2": "You could have fed 51,206.06 Ethiopian children... or like a dozen American ones.", "post_22": "Palantir raises annual revenue forecast on 'unprecedented demand' for AI platform", "post_22_comment_1": "AH went from -11% back to green, damn.", "post_22_comment_2": "PLTR is buying back $1bil in shares, and has 3.1Bil liquid", "post_23": "Daily Discussion Thread for August 08, 2023", "post_23_comment_1": "NVDA, calls or puts??", "post_23_comment_2": "You can have your stock market rally, just stay away from my yields!", "post_24": "$30k Tesla YOLO - 🐻", "post_24_comment_1": "lmao missed the dip and going back in right at the bottom", "post_24_comment_2": "My condolences to your remaining 25k", "post_25": "Jim Cramer sees more positives than negatives for the market ☠️☠️💀😰", "post_25_comment_1": "Jim Cramer is the type of guy who would pee next to you when there are other open urinals that are further away.", "post_25_comment_2": "Jim Cramer is a fun stock market mascot. These times have been good as we’re still living with the greats of our time.", "post_26": "$TLRY - Tilray buys 8 brands from AB", "post_26_comment_1": "I knew I made a good play a while back", "post_26_comment_2": "Also up 15% in AH..", "post_27": "NGL is just getting started!", "post_27_comment_1": "Not gonna lie, that’s impressive", "post_27_comment_2": "Not Gonna Lie, I know nothing about it."}