{"post_0": "What Are Your Moves Tomorrow, August 07, 2023", "post_0_comment_0": "Bears are gonna feel that pain you feel when you see a chad lifting your GF at the beach.", "post_0_comment_1": "Berkshire Hatahway made $ 10 billion dollars last quarter. $ 10 fucking billion. They are at a $ 40 billion 12 month run rate.", "post_0_comment_2": "Buy high, sell low", "post_0_comment_3": "Are PLTR puts inverse WSB?", "post_0_comment_4": "Then the Middle East would be very sparsely populated", "post_1": "Most Anticipated Earnings Releases for the week beginning August 7th, 2023", "post_1_comment_0": "Im either losing everything or gaining generational wealth next week", "post_1_comment_1": "Thinking about calls on PLTR, but not sure. Time to lose what I made on AMZN today", "post_1_comment_2": "Their record is 2 wins and 1 losses.", "post_1_comment_3": "Calls it is", "post_1_comment_4": "After market Tuesday is gonna cost WSB so much fucking money.", "post_2": "Mortgage rates at its highest in 23 years, don't worry you all it's priced in", "post_2_comment_1": "This Chart looks like a fucking Penny Stock.", "post_2_comment_2": "My first house was 97k with an 8.5% rate, it was a trash heap, my 300k mortgage now is only $700 more a month. I worry for my kids.", "post_2_comment_3": "Fucking same. Got a 2.5% for 30 years and I'm not moving for a long time.", "post_2_comment_4": "After the 2008 subprime mess, the majority of mortgages are now on fixed rates, which is why we haven't seen huge default rates with the rise in the 10-year", "post_3": "😂", "post_3_comment_1": "Wow, a billionaire is reading my comment.", "post_3_comment_2": "u/VisualMods story of existence", "post_3_comment_3": "This article didn’t even have the balls to name the subreddit it was so obviously talking about", "post_3_comment_4": "Those tools have been creating \"meme stocks\" for ages, and profiting off the manipulation on both the upside and downside. The fact a variant has come about and is accessible to and playable by \"those heathen filthy casual retailers\" isn't a big deal, really...the market eventually gets fed its' pound of flesh...", "post_4": "It’s really happening, Battle of the Billionaires", "post_4_comment_1": "Who posted this? 😂", "post_4_comment_2": "He probably thinks that Zuck will refuse to accept twitter having exclusive streaming rights. Then Elon can act like he really wanted to fight, but Zuck cancelled it. Stupid people will believe Elon. Elon will believe himself. The world will continue to turn.", "post_4_comment_3": "ChatGPT draw me a fake picture of Elon must with muscles and not fat.", "post_4_comment_4": "They are doing it incorrectly. The correct way to do it is that the winner takes all the assets of the loser minus 20 million. Then the winner and the loser post the win and loss porn in WSB. Any other way to do it is bullsh*t.", "post_5": "But I love watching videos on X Premium", "post_5_comment_1": "TFW BoA takes your tax-funded bailout money and then turns around and calls you an incel.", "post_5_comment_2": "Dad: “ a Premium? even I use a free version”", "post_5_comment_3": "Algebra?", "post_5_comment_4": "It’s equally as embarrassing to pay for twitter premium", "post_6": "What happens to Tesla stock if Mark kills Elon?", "post_6_comment_1": "Yo its Yilong Ma", "post_6_comment_2": "Exactly. The real Elon is hanging out in China now.", "post_6_comment_3": "!banbet parlay : Elon dies at the hands of the lizard man and stock hits $420.69 under 2.5 months", "post_6_comment_4": "This guy thinks the markets care about fundamentals🤣", "post_7": "Should we short protein stocks given Jim is making a chili?", "post_7_comment_2": "He used bynd meat", "post_7_comment_3": "He might have.", "post_7_comment_4": "Excellent, top post is about the eagles hat. My thoughts exactly.", "post_8": "I wish she knew I did it for her", "post_8_comment_1": "Oh believe me they are going down due to theta, prices just won't update until market open on Monday.", "post_8_comment_2": "You just need 1 home run", "post_8_comment_3": "Big fish is just waiting to be caught", "post_8_comment_4": "Inverse your trades, sell the call options that you want to buy. You can thank your wife's bf.", "post_9": "I guess I belong here after all", "post_9_comment_1": "But look on the bright side, you have a chance to make 4.9% on all of that $1.24", "post_9_comment_2": "I'm not surprised that you're doing well with your investments, considering how intelligent and rich you are. However, I think it's important to remember that there are always going to be people who are poorer and less intelligent than you, so don't let them get in the way of your success.", "post_9_comment_3": "Did you try to short nvidia?", "post_9_comment_4": "That's a good start.", "post_10": "Factual", "post_10_comment_1": "Only wallstreetbets can upvote this", "post_10_comment_2": "House of cards", "post_10_comment_3": "That's my meme !!!!", "post_10_comment_4": "Took my upvote away when I realized this had already been posted here. Stop being gay", "post_11": "Does anyone make a full time income with this?", "post_11_comment_1": "I chip away elegantly at my full time income with this", "post_11_comment_2": "I put 2 kids through college with my options trading, it's my broker's kids but still", "post_11_comment_3": "I refuse to quit my full time job. It's more money and it's such an easy IT job making $65K/year.", "post_11_comment_4": "I made $300 so far this year, so yeah safe to say I’ll be retiring soon", "post_12": "Major indexes don't look so good on a monthly view", "post_12_comment_1": "If I don’t like the looks on one time frame, I look at other time frames until I find one I like", "post_12_comment_2": "This will come true just for meme potential", "post_12_comment_3": "Thank you for your analysis. I agree that the market is heading lower in the short-term, but I believe that it will eventually rebound and head higher over the long-term. Thank you for your time!", "post_12_comment_4": "You’ve legit caused the market to trade left tomorrow due to this analysis", "post_13": "A quick reminder that accounting can sugar code even armageddon. Cash Flow > Revenue", "post_13_comment_1": "You sunk my battleship...", "post_13_comment_2": "on the same note, cash flow is a very easily manipulated metric as well. obviously no single financial ratio can completely give you full insight into the business but I definitely look at positive net income and a strong enterprise ratio.", "post_13_comment_3": "r/boneappletea", "post_13_comment_4": "Free cash flow is the godfather of punk"}